src/runners/examples/artillery-socketio.example.yml
# Custom Artillery script for the Socket.IO engine. Runs in Artillery's own
# engine — see https://www.artillery.io/docs/reference/engines/socketio
#
# The dashboard injects its `ltd-publish` plugin into config.plugins at run time
# so the live charts keep working — you do not need to add it yourself, and any
# plugins you declare here are preserved.
#
# Target: `npm run target:socketio` (tools/socketio-target.mjs) — it acks every
# "order.create" with { status: "ok", id, echo } and also pushes an
# "order.created" event, so both the acknowledge and listen paths work.
config:
  target: "http://127.0.0.1:4396"
  phases:
    - name: warmup
      duration: 10
      arrivalRate: 5
    - name: ramp
      duration: 20
      arrivalRate: 5
      rampTo: 40
  socketio:
    transports: ["websocket"]

# Several scenarios split the same load rather than adding to it: every virtual
# user the phases above create runs exactly one of them, picked by `weight`.
# Here three in four browse, one in four checks out.
scenarios:
  - engine: socketio
    name: browse
    weight: 3
    flow:
      # Fire and forget — no acknowledgement, so nothing is waited on.
      - emit:
          channel: "order.create"
          data: { sku: "abc-123", qty: 1 }
      - think: 1

  - engine: socketio
    name: checkout
    weight: 1
    flow:
      # Send a message and wait for its acknowledgement, asserting on the
      # ack payload — Artillery's documented emit + acknowledge pattern.
      - emit:
          channel: "order.create"
          data: { sku: "abc-123", qty: 5 }
        acknowledge:
          match:
            json: "$[0].status"
            value: "ok"
      - think: 1